<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Province;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
         // Create 5 brands
         $provinces = ['آذربایجان شرقی', 'آذربایجان غربی', 'اردبیل', 'اصفهان', 'البرز', 'ایلام', 'بوشهر','تهران','چهارمحال وبختیاری','خراسان جنوبی','خراسان رضوی','خراسان شمالی','خوزستان','زنجان','سمنان','سیستان و بلوچستان','فارس','قزوین','قم','کردستان','کرمان','کرمانشاه','کهگلویه و بویراحمد','گلستان','گیلان','لرستان','مازندران','مرکزی','هرمزگان','همدان','یزد'];
         foreach ($provinces as $province) {
             Province::create(["province_name" => $province]);
         }

         // Create 5 brands
         $cities = ['جوانقلعه', 'آبش احمد', 'آ‌ذرشهر', 'آقکند', 'اسکا نلو', 'اسکلو','اسکو','اهر','ایلخچی','باسمنج','بخشایش','بستان آباد','بناب','بندر آق گنبد','بندر شرفخانه','بنه کهل','بیلوردی','تبریز','ترک','ترکمانچای','تسوج','تیکمه داش','تیمورلو','جانانلو','جلفا','جمال آباد','خاروانا','خامنه','خراجو','خسروشاه','خمارلو','حواجه','دوزدوزان','زرنق','زنوز','سراب','سردرود','سعید آباد','سیس','سیه رود','شبستر','شربیان','شندآباد','شهرجدیدسهند','صوفیان','عجب شیر','علی آباد هشترود','قره آغاج(آ-شرقی)','قره بلاغ','قره چمن','قزل دیزج','قزلجه میدان','کردکندی','کشکسرای','کلوانق','کلیان','کلیبر','کندوان','گنج گاه','گوگان','لیقوان','لیلان','مایان سفلی','مراغه','مرند','ملکان','ممقان','مهربان','میانه','نوردوز','وایقان',',ورزقان','هادی شهر','هریس','هشترود','هوراند','یامچی','یوسف آباد'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 1
             ]);
         }

         // Create 5 brands
         $cities = ['آرمناک', 'آواجیق', 'احمدآباد زنجان', 'ارنسا', 'ارومیه', 'اشنویه','امامزاده ارومیه','ایواغلی','با لانج','باروق','بازرگان','بندرگلمانخانه','بورالان','بوکان','بیوران','پسوه','پلدشت','پیرانشهر','تازه شهر','تپه رش','تکاب','تمرچین','جلدیان','چالدران','چپ دره','چهاربرج','خلیفان','خوی',' دیزج دیز','رازی','راژان','زیوه','سردشت','سرو','سلماس','شاهیندژ','شوط','شهریکند','شیخ سیلو','طلاتپه','فره آغاج ارومیه','فیرورق','قارنیچه','قره ضیاءالدین','قره کلیسا','قطور','قوشچی','قولنجی','کشاورز','کشمش تپه','کیتکه','ماکو','محمدیار','محمودآباد','مرگن لر','مرگنلر','موانا','مهاباد','میاندوآب','میرآباد','نقده','نوشین شهر','یولاگلدی'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 2
             ]);
         }

         // Create 5 brands
         $cities = ['آبی بیگلو', 'اردبیل', 'اصلاندوز ', 'بیله سوار', 'پارس آباد', 'جعفرآباد(اردبیل)','خلخال','دولت آباد(اردبیل','رضی','سرعین','سولا','فیروزآباد(اردبیل)','قره آغاج(اردبیل)','کلور','کورائیم','گرمی','گیوی(کوثر)','لاهرود','مشگین شهر','نمین','نوجه ده','نیر(اردبیل)','هشتجین','هیر'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 3
             ]);
         }

         // Create 5 brands
         $cities = ['گرگاب', 'آران و بیدگل', 'آقاعلی عباس', 'ابوزیدآباد', 'اردستان', 'اریسمان', 'اژیه','اصفهان','افجان','افوس ','انارک','بادرود','باغ بهادران','باغشاد','برزک','بوئین میاندشت','بهاران شهر','بیاضیه','پوده','پیربکران','تودشک','تیران','جندق','جوشقان قالی','چادگان','چرمهین','چمگردان','حبیب آباد اصفهان','حسن آباد اصفهان','حسینچه','حنا','خمینی شهر','خوانسار','خوراصفهان','خورزوق','خولنجان','داران','دامنه','درچه','دستجاه','دستگرد','دولت آباد اصفهان','دهاقان','دهق','دیزیچه','رامشه','راوند','رحمت آباد اصفهان','رزوه','زازران','زاینده رود','زرین شهر','زفره','زواره','زیار','سجزی','سده لنجان','سعیدآباد گلپایگان','سمیرم','سه راهی علویجه','سین','شاپورآباد','شاهین شهر','شجاع آباد','شهرابریشم','شهرضا','طرق رود','ظفرقند','عسگران','علویجه','فرخی','فریدونشهر','فلاورجان','فولادشهر','فین','قمصر','قهدریجان','کاشان','کامو و چوگان','کلیشاد','کمشچه','کمه','کوشک','کوهپایه اصفهان','کهریزسنگ','گز','گلپایگان','گلدشت','گلشن','گوگد','مبارکه','محمدآباد اصفهان','مرشدآباد','مشکات','مشهداردهال','مورچه خورت','موغار','مهاباد','میمه','نائین','نجف آباد','نصرآبادجرقویه سفلی','نطنز','نوش آباد','نیاسر','نیک آباد','ورتون','ورزنه','ورنامخواست','وزوان','ونک','هاردنگ','هرند'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 4
             ]);
         }

         // Create 5 brands
         $cities = ['آسارا', 'اشتهارد', 'برغان', 'تنکمان', 'جوستان', 'چهار باغ', 'دیزین','شهر جدید هشتگرد','شهرستانک','طالقان','فردیس','کرج','کردان','کمال شهر','کوهسار','گچسر','گرمدره','گلسار','ماهدشت','محمد شهر','مشکین دشت','نجم آباد','نظرآباد','ولیان','هشتگرد'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 5
             ]);
         }

         // Create 5 brands
         $cities = ['آبدانان', 'آسمان آباد', 'ابوغریب', 'ارکواز', 'ایلام', 'ایوان', 'بدره','پتک','پهله','پیازآباد','توحید','چشمه شیرین','چوار','چهارمله','دره شهر','دشت عباس','دهلران','زرنه','سراب باغ','سرابله','شباب','صالح آباد(ایلام)','فکه','کهره','گنبد پیرمحمد','لومار','مورت','مورموری','موسیان','مهران','میمه ایلام','هلیلان'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 6
             ]);
         }

         // Create 5 brands
         $cities = ['آب پخش', 'آبدان', 'احمدی', 'امام حسن', 'انارستان', 'اهرم', 'بادوله','باشی','برازجان','بردخون','بردستان','بندر سیراف','بندر دیر','بندررستمی','بندرریگ','بندرگناوه','بنک','بوشکان','بوشهر','بیدخون','پشت پر','تنگ ارم','جاشک','جم','جم','چاه کوتاه','چاه مبارک','چغادک','خارگ','خورموج','دالکی','دلوار','دوراهک','دیلم','ریز','سعدآباد','سمل','شبانکاره','شنبه','عالیشهر','عربی','عسلویه','کاکی','کلمه','کنگان','نخل تقی','وحدتیه'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 7
             ]);
         }

         // Create 5 brands
         $cities = ['چهاردانگه', 'آبسرد', 'آهار', 'احمدآباد مستوفی', 'اخترآباد', 'اسلام شهر', 'امامزاده داود','اندیشه','باقرآباد ورامین','باقرشهر','بومهن','پاکدشت','پردیس','پرند','پیشوا','تهران','جاجرود','جواد آباد ورامین','چنداب','حسن آباد تهران','دماوند','دواب سمنان','رباط کریم','رودهن','سلطان آباد تهران','سنگان تهران','شاهدشهر','شریف آباد','شمشک','شورآباد','شهرری','شهریار','صالحیه','صفادشت','فردوسیه','فشم','فیروزآباد تهران','فیروزکوه','قدس','قرچک','قلعه نو ورامین','کهریزک','کیلان','گلستان','لشکرک','لواسان','ملارد','نسیم شهر','نصیر شهر','نعلبندان','ورامین','وهن آباد'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 8
             ]);
         }

         // Create 5 brands
         $cities = ['چلیچه', 'اردل', 'باباحیدر', 'بروجن', 'بلداجی', 'بن', 'جونقان','چلگرد','حیدری','دستگرد','دشتک','دوآب چهارمحال','دیمه','سامان','سرخون','سردشت(چهارمحال)','سفیددشت','سورشجان','شلمزار','شهرکرد','شیخ شبان','طاقانک','فارسان','فرادنبه','فرخشهر','کاج','کلواری','کیان','گندمان','گوشکی','گهرو','لردگان','منج','ناغان','نقنه','هفشجان','هوره','یان چشمه'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 9
             ]);
         }

         // Create 5 brands
         $cities = ['آیسک', 'ارسک', 'اسدیه', 'اسفدن', 'القورات', 'باغستان', 'برون','بسطاق','بشرویه','بیرجند','پترگان','جعفرآباد قوچان','جوخواه','حاجی آباد','خضریً دشت بیاض','خور خراسان','خوسف','درح','درمیان','دوست آباد','ده محمد','دیهوک','رباط خان','زهان','سده خراسان','سرایان','سربیشه','سه قلعه','شاهرخت','شوسف','طبس','طبس مسینا','طبسین','عرب آباد','عشق آباد','فردوس','قاین','قرقری','قلعه سرخ','کرغند','گزیک','مزارسیدعلی','معدن حاجات','منصورآباد بیرجند','مود','نای بند','نهبندان','نیمبلوک'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 10
             ]);
         }

         // Create 5 brands
         $cities = ['اسحاق آباد', 'آبروان', 'اسدآباد خراسان', 'امام تقی', 'امام قلی', 'انابد', 'باجگیران','باخزر','بار','باغچه','بایگ','بجستان','بردسکن','برزنون','بیدخت','بینالود','پروند','تایباد','تربت جام','تربت حیدریه','تلخ بخش گلبو','جغتای','جنگل','چکنه','چناران','چویلی','حارث آباد','حصارخراسان','حکم آباد','خرو','خضری','خلیل آباد','خواف','داورزن','دررود','درگز','دوغارون','دولت اباد','دهانه قلعه','رباط سفید','رباط سنگ','رشتخوار','روداب','روشناوند','ریوش','سبزوار','سرخس','سلامی','سلطان آباد','سمیع آباد','سنگ بست','سنگان(خراسان)','سنو','شادمهر','شاندیز','ششتمد','شفیع آبادسبزوار','شورستان','شهر زو','صالح آباد خراسان','طرقبه','عبدالله گیو','عشق آباد','عمرانی','فریمان','فیروزه','فیض آباد','قاسم آباد','قدمگاه','قوچان','کاخک','کاشمر','کاهک','کدکن','کلات نادری','کندر','گرماب','گلبهار','گناباد','لطف آباد','ماروسک','مشهد','مشهدریزه','نقاب','نیازآباد','نیشابور','نیل شهر','همت آباد','یونسی'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 11
             ]);
         }
         // Create 5 brands
         $cities = ['آشخانه', 'اسفراین', 'ایور', 'بام', 'بجنورد', 'تیتکانلو', 'جاجرم','چمن بید','چناران شهر','درق','راز','رباط قره بیل','سنخواست','شوقان','شیروان','صفی آباد','غلامان','فاروج','گراتی','گرمه','مرغزار'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 12
             ]);
         }
         // Create 5 brands
         $cities = ['آبادان', 'آبژدان', 'آغاجاری', 'اروندکنار', 'الوان', 'امیدیه', 'اندیمشک','اهواز','ایذه','باغملک','بستان','بندر امام','بهبهان','بید بلند','بیدروبه','پل زال','پیون','تنگه چذابه','جایزان','جزیره مینو','جفال','جنت مکان','چغازنبیل','چغامیش','چنانه','چوبیده','حر','حسینیه','حمیدیه','خرمشهر','دارخوین','دزفول','دهدز','رامشیر','رامهرمز','زهره','سادات حسینی','سد شهید عباسپور','سددز','سربندر','سردشت خوزستان','سوسنگرد','سیاه منصور','شادگان','شاوور','شلیلی','شوش','شهر امام ره','شهر میانرود','شیبان','صالح شهر','صفی آباد دزفول','صیدون','طلائیه','عقیلی','فتح المبین','قفاص','قلعه خواجه','کاویان','کوشک','گتوند','گرگر','گوریه','لالی','مازو','ماهشهر','مسجدسلیمان','مشراگه','ملاثانی','میانکوه','میداوود','نفت سفید','نمره یک','ویس','هفت تپه','هفتکل','هفتگل','هندیجان','هویزه','یزدنو'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 13
             ]);
         }

         // Create 5 brands
         $cities = ['آب بر', 'آببر', 'ابهر', 'ابهر', 'تهم', 'چورزق', 'حصارزنجان','حلب','خرمدره','درام','دندی','زرین آباد زنجان','زرین رود','زنجان','سجاس','سرچم','سلطانیه','سهرورد','صائین قلعه','قیدار','کرسف','گرماب','گیلوان','ماه نشان','محمودآبادزنجان','هیدج'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 14
             ]);
         }

         // Create 5 brands
         $cities = ['آرادان', 'آستانه سمنان', 'ایوانکی', 'بسطام', 'بیارجمند', 'چاشم', 'دامغان','درجزین','دیباج','سرخه','سمنان','شاهرود','شهمیرزاد','علی آباد','فولادمحله','کلاته خیج','کلاته رودبار','کهن آباد','گرمسار','مجن','معلمان','مهدی شهر','میامی'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 15
             ]);
         }

         // Create 5 brands
         $cities = ['ادیمی', 'اسپکه', 'اسکل آباد', 'ایرانشهر', 'ایرندگان', 'بریس', 'بزمان','بمپور','بنت','بنجار','بندان','پارود','پیشین','تاسوکی','جالق','جزینک','جکیگور','چابهار','چانف','خاش','دوست محمد','ده پابید','راسک','رحمت آباد سوران','رزاق زاده','زابل','زاهدان','زرآباد','زهک','سراوان','سرباز','سفیدابه','سنگان سیستان','سوران','فنوج','قصرقند','کارواندر','کافه بلوچی','کله گان','کنارک','گشت','گلپورگان','گلمورتی','گواتر','گوهرکوه','لادیز','لاویز','لوتک','محمدآباد سیستان','محمداباد ادیمی','مهرستان','میرجاوه','ناهوک','نصرت آباد سیستان','نگور','نوک آباد','نیک شهر'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 16
             ]);
         }

         // Create 5 brands
         $cities = ['ارد', 'آباده', 'آباده طشک', 'آسپاس', 'ابوالحیات', 'احشام', 'ارسنجان','استهبان','اسیر','اشکنان','افزر','اقلید','اکبرآباد شیراز','اوز فارس','اهل','ایج','ایزدخواست','باب انار','باباگوری','بابامنیر','بنارویه','بندامیر','بوانات','بهمن','بیرم','بیضا','تیزاب','جره و بالاده','جنت آباد','جنت شهر','جویم','جهرم','جیان','چاه ورز','چنارشاهیجان','حاجی آباد فارس','حسامی','حسن آباد','خانه زنیان','خاوران','خرامه','خسروشیرین','خسویه','خشت','خنج','خوانسار(فارس)','خوزی','خومه زار','خیرگو','داراب','داراکویه','داریان','دبیران','درز','درودزن','دریس','دژکرد','دشت برم','دولت آباد فارس','ده شیخ (لامرد)','دهرم','دهستان خیرگو','دیندارلو','رستاق','رکن آباد','رونیز','زاهد شهر','زرقان','سپیدان','سده فارس','سروستان بوانات','سروستان شیراز','سعادت شهر','سورمق','سیمکان','ششده','شهر جدید صدرا','شهرپیر','شیراز','صغاد','صفاشهر','علامرودشت','علی آباد فارس','عمادده','فتح آباد','فداغ','فدامی','فراشبند','فسا','فورگ','فیروزآباد فارس','قادرآباد','قطب آباد','قطرویه','قلات','قیر','کارزین','کازرون','کامفیروز','کره ای','کنارتخته','کوار','کوپن','کوهمره','گراش','گله دار','لار','لامرد','لپویی','لطیفی','مبارک آباد','مرودشت','مزایجان','مشکان','مصیری','منصورآباد(فارس)','مهر','میانشهر','میشان','میمند','نوجین','نودان','نورآباد ممسنی','نی ریز','وراوی','هرمودباغ','هماشهر'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 17
             ]);
         }

         // Create 5 brands
         $cities = ['آبگرم', 'آبیک', 'آوج', 'ارداق', 'اسفرورین', 'اقبالیه', 'البرز','الوند','بوئین زهرا','بهرام آباد زنجان','بیدستان','تاکستان','دانسفهان','سیردان','شال','شریفیه','شهرک صنعتی البرز','شهرک محمدیه','ضیاآباد','قزوین','کلنجین','محمودآباد(قزوین)','محمودآباد نمونه','معلم کلایه','نهاوند خرمدشت','نیارک'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 18
             ]);
         }

         // Create 5 brands
         $cities = ['باغیک', 'دستجرد', 'راهجرد', 'سلفچگان', 'طغرود', 'قم', 'کهک قم','گازران','نیزار'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 19
             ]);
         }

         // Create 5 brands
         $cities = ['آرمردره', 'آگجه', 'باشماق', 'بانه', 'بیجار', 'پیرتاج', 'توپ آغاج','تیژ تیژ','حسین آباد کردستان','داشبلاغ','دلبران','دهگلان','دیزگران','دیواندره','زرینه','سرا','سروآباد','سریش آباد','سقز','سنته','سنندج','سوته','صاحب','علی آباد کردستان','قروه','قزل بلاغ','کامیاران','گشکی','مریوان','موچش','یاسوکند'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 20
             ]);
         }

         // Create 5 brands
         $cities = ['اختیارآباد', 'ارزوئیه', 'اسلام آباد جیرفت', 'امین شهر', 'انار', 'اندوهجرد', 'باغین','بافت','بردسیر','بروات','بلوک','بم','بهرمان','بیاض','پاریز','جبالبارز(عنبرآباد)','جبالبارز(جیرفت)','جوادیه فلاح','جوپار','جوزم','جوشان','جیرفت','چاه ریگان','چترود','حسین آباد گروه','خاتون آباد(شهربابک)','خبر بافت','دارزین','داوران','ده علی','دهبکری','دهج','رابر','راور','راین','رحمت آباد ریکان','رستم آباد ریکان','رفسنجان','رودبار','زرند','زنگی آباد','زهکلوت','ساردوئیه','سرچشمه','سیرجان','سیرچ','شفیع آبادکرمان','شمس','شهداد','شهربابک','عنبرآباد','فاریاب','فاریاب کرمان','فهرج','قلعه گنج','کرمان','کشکوئیه','کوهبنان','کوهپایه','کهنوج','کیانشهر','گلباف','گنبکی','مانی','ماهان','منوجان','نظام شهر','نگار','نودژ','وکیل آباد کرمان','هنزا'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 21
             ]);
         }

         // Create 5 brands
         $cities = ['آب باریک', 'ازگله', 'اسلام آباد غرب', 'بابا یادگار', 'بانه وره', 'باینگان', 'بزمیرآباد','بیستون','پاوه','تازه آباد کرمانشاه','جوانرود','جیحون آباد','چهارزبر','حمیل','خسروی','دوآب نوسود','روانسر','ریجاب','سرآب ذهاب','سرپل ذهاب','سرمست گوار','سنقر','سومار','شیخ جبرئیل','شیخ صله','شیرازی سفلی','صحنه','قزانچی','قزقبری','قصرشیرین','قلعه شاهخانی','کرمانشاه','کرند','کنگاور','کوزران','گورسفید','گهواره','گیلانغرب','ماهیدشت کرمانشاه','میان راهان','نفت شهر','نودشه','نوسود','هرسین','هلشی'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 22
             ]);
         }

         // Create 5 brands
         $cities = ['باشت', 'پاتاوه', 'چرام', 'دوگنبدان', 'دهدشت', 'دیشموک', 'سادات','سرفاریاب','سوق','سی سخت','قلعه رئیسی','لنده','لیکک','مارگون','میمند(یاسوج)','یاسوج'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 23
             ]);
         }

         // Create 5 brands
         $cities = ['آزادشهر', 'آق قلا', 'اینچه برون', 'بندر ترکمن', 'بندر گز', 'تقی آباد گلستان', 'خان ببین','دلند','رامیان','سنگدوین','سیمین شهر','علی آباد کتول','فاضل آباد گلستان','کرد کوی','کلاله','گالیکش','گرگان','گمیشان','گنبد کاووس','مراوه تپه','مزرعه','مینودشت','نگین شهر','نوده خاندوز','نوکنده'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 24
             ]);
         }

         // Create 5 brands
         $cities = ['آبکنار', 'آستارا', 'آستانه اشرفیه', 'اباتر', 'احمد سرگوراب', 'اسالم', 'اطاقور','املش','امین آباد گیلان','بازار جمعه','بازکیاگوراب','بندر انزلی','پره سر','پونل','پیربازار','پیرسرا','تالش','توتکابن','جیرده','جیرنده','چابکسر','چاف','چوبر','چینی جان','حسن رود','حویق','حیران','خرما','خشک بیجار','خمام','دریا وارسر','دیلمان','رحیم آباد گیلان','رستم آباد گیلان','رشت','رضوانشهر','رودبار','رودبارکی','رودبنه','رودسر','زیباکنار','سراوان گیلان','سنگر','سیاهکل','شاندرمن','شفت','شلمان','شیجان','شیخ محله گیلان','شیرجوپشت','صومعه سرا','ضیابر','طاهر گوراب','فومن','کپورچال','کته سر','کردمحله','کسما','کلاچای','کلان کلایه','کلید بر','کلیشم','کناردریا','کوچصفهان','کوریه','کومله','کیاشهر','گلسر','گوراب زرمیخ','گیل کلایه','لاکان','لاهیجان','لشت نشا','لنگرود','لوشان','لولمان','لوندویل','لیسار','ماسال','ماسوله','ملاسرا','منجیل','نصیرمحله'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 25
             ]);
         }

         // Create 5 brands
         $cities = ['ازنا', 'اشترینان', 'الشتر', 'الیگودرز', 'بابازید', 'بروجرد', 'بشارت','پلدختر','تمرک','چالان چولان','چغابل','چغلوندی','خرم آباد','دورود','زاغه','سپید دشت','شاهزاده محمد','شول آباد','فیروزآباد لرستان','قاقان','قلعه نو','کاکارضا','کوهدشت','کوهنانی','گراب','معمولان','مومن آباد','نورآباد لرستان'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 26
             ]);
         }

         // Create 5 brands
         $cities = ['آب اسک', 'آزادمهر', 'آلادشت', 'آمل', 'آهنگرکلا', 'ارطه', 'استخرپشت','اشکور','امامزاده عبدالله','امیرکلا','امین آباد مازندران','اوز تهران','بابل','بابل','بابلسر','بایجان','بلده','بهشهر','بهنمیر','پل سرا','پلور','پول','تازه آباد مازندران','تاکام','تنکابن','جواهرده','جویبار','چالوس','چمستان','چورته','خرم آباد تنکابن','خزرآباد','خشرودپی','خوش رودپی','درویش خلیل','دریاکنار','دوآب کجور','رامسر','رستم کلا','رودبست','رویان','زاغمرز','زرشک دره','زرگرمحله','زیرآب مازندران','سادات شهر','ساری','سرخرود','سردآبرود','سفیدچال','سلمان شهر','سلمانشهر','سنگتاب','سورک','سیاهکلا','شارقلت','شیرگاه','عباس آباد','علی آباد مازندران','فریدونکنار','قائم شهر','کتالم','کترا','کجور','کلار آباد','کلارآباد','کلاردشت','کلاگرمحله','کلوده','کلیج خیل','کوه خیل','کیاسر','کیاکلا','گاسکرمحله','گزنک','گلوگاه','گلوگاه بابل','گهرباران','لاجیم','لاریم','محمدآباد مازندران','محمودآباد مازندران','مرزن آباد','مرزیکلا','معلم کلا','میربازار','نشتاود','نکا','نور','نوشهر','ولی آباد تنکابن','ولیسده','ونوش','هادی شهر','هچیرود'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 27
             ]);
         }

         // Create 5 brands
         $cities = ['آشتیان', 'ابراهیم آباد', 'اراک', 'پرندک-مرکزی', 'تفرش', 'توره', 'جاورسیان','خشکرود-مرکزی','خمین','خنجین','خنداب','داوداباد','دلیجان','دودهک','دهنو','رازقان-خرقان','زاویه-مرکزی','ساروق','ساوه','شازند','شیرین آباد فرمهین','صالح آباد مرکزی','غرق آباد','فرمهین','کمیجان','گلاوند','مالمیر','مامونیه-مرکزی','محلات','مرکزی(مهاجران)','میلاجرد','نراق','نوبران','نیمور','هندودر'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 28
             ]);
         }

         // Create 5 brands
         $cities = ['ابوموسی', 'اسکله شهید باهنر', 'اسکله شهید رجایی', 'برنطین', 'بستک', 'بندر خمیر', 'بندر عباس','بندر مقام','بندر چاک','بندرلنگه','بیکا','پارسیان','تازیان پایین','تخت','تیرور','جاسک','جغین','جکدان','حاجی آباد هرمزگان','درپهن','درگهان','دهبارز','راهدار','رودان','رویدر','زیارتعلی','سردشت(بشاگرد)','سندرک','سوزا','سیاهو','سیری','سیریک','شمیل','فارغان','فاریاب هرمزگان','فین هرمزگان','قشم','کاروان','کلاهی','کنگ','کوشکنار','کوهستک','کهورستان','کیش','گنو','گوهران','لاوان','میناب','هشتبندی(هشت بندی)'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 29
             ]);
         }

         // Create 5 brands
         $cities = ['آجین', 'آرتیمان', 'آقبلاغ', 'ازندریان', 'اسدآباد', 'اسلامشهر آق گل', 'اشتران','اکنلو','اورقین','برزول','بشیک تپه','بهار','تویسرکان','جوراب','جوکار','خردمند','دمق','رزن','زنگنه','سامن','سرکان','سوزن','سیاه کمر','صالح آباد همدان','طاسبندی','علی آباد دمق','علی صدر','فامنین','فرسفج','فیروزان','قروه درجزین','قهاوند','کبودرآهنگ','کوریجان','گاماسیاب','گل تپه','گیان','لالجین','مسلم آباد','ملایر','نهاوند','وردآورد','همدان'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 30
             ]);
         }

         // Create 5 brands
         $cities = ['ابرکوه', 'اردکان', 'اشکذر', 'بافق', 'بهاباد', 'تفت', 'تنگ چنار','توتک','خرانق','خضرآباد','ده بالا','دهشیر','رباط پشت بادام','زارچ','زردین','ساغند','سخوید','طرزجان','عقدا','علی آباد چهل گزی','فهرج','کهدوئیه','گاریز','مروست','مهردشت','مهریز','میبد','ندوشن','نیر یزد','هامانه','هرات یزد','یزد'];
         foreach ($cities as $city) {
             City::create([
                 "city_name" => $city,
                 "province_id" => 31
             ]);
         }



     }
}
