<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $cities = ['مشهد', 'مازندران', 'کاشان', 'آران و بیدگل', 'سرعین', 'رشت', 'قشم', 'کیش', 'همدان', 'یزد', 'چالوس', 'چمستان', 'امامزاده داود', 'اصفهان', 'بندر عباس', 'گیلان', 'کرمانشاه', 'قم', 'اهر', 'تبریز', 'جلفا', 'شبستر', 'کندوان', 'مراغه', 'مرند', 'میانه', 'ورزقان', 'ارومیه', 'پیرانشهر', 'خوی', 'اردبیل', 'خلخال', 'مشگین شهر', 'گلپایگان', 'نائین', 'برغان', 'چهار باغ', 'دیزین', 'طالقان', 'کرج', 'بوشهر', 'تهران', 'جاجرود', 'آبادان', 'اهواز', 'سمنان', 'شاهرود', 'زنجان', 'رفسنجان', 'شیراز', 'گرگان', 'کرمان', 'آبکنار', 'آستارا', 'آستانه اشرفیه', 'بندر انزلی', 'تونکابن', 'آمل', 'امامزاده عبدالله', 'بابل', 'آمل', 'پلور', 'خزرآباد', 'رامسر', 'ساری', 'کلاردشت', 'لرستان', 'اراک', 'بروجرد', 'ابوموسی', 'لندن', 'پاریس', 'دبی', 'استانبول', 'آنتالیا', 'بالی', 'ارمنستان', 'آذربایجان', 'روسیه', 'تایلند', 'مالزی', 'برزیل'];

        foreach ($cities as $city) {
            City::create([
                "city_name" => $city
            ]);
        }
    }
}
