<?php

namespace Database\Seeders;

use App\Models\Tour;
use App\Models\Trip;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class TourSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $tour1 = Tour::create([
            "title" => "گلاب گیری کاشان",
            "description" => "تور 3 روز گلاب گیری کاشان",
            "transport" => "bus",
            "stay_class" => "hotel_apartment",
            "city_id" => "3",
            "details" => [
                "services" => "تمام وعده های غذایی شما حتی تا یک وعده اضافه با تور می‌باشد\nهمراهی بومیان آن منطقه جهت کشف مناطق بکر و دست نخورده\nهمراهی عکاس گروهی برای ثبت لحظات ناب شما\nتورلیدر با تجربه برای امنیت خاطر شما\nگشت و گذار آزادانه در مناطق مشخص شده طبق نظر تورلیدر شما",
                "stay_details" => "1 روز در مسیر و توقف در اماکن گردشگری در مسیر\n1 روز جنگل گردی\n2 روز کمپ و چادر",
                "documents" => "اسکن رنگی پاسپورت مسافر با حداقل 7 ماه اعتبار\nبیمه مسافرتی حداقل 30,000 دلار به تعداد روزهای سفر\nعکس 4*6 پشت سفید\nبلیط رفت و برگشت",
                "rules" => "حداقل بایستی 7 ماه تا تاریخ انقضای پاسپورت شما زمان باقی مانده باشد.\nپرداخت عوارض خروج از کشور به‌عهده مسافران گرامی است.\nتمامی هتل‌ها بصورت گارانتی می‌باشد و در صورت کنسلی هزینه‌ای عودت نخواهد شد.\nرخداد هرگونه حادثه‌ی طبیعی در سفر، احتمال تغییر در برنامه‌ی سفر را به‌دنبال خواهد داشت."
            ]
        ]);
        $tour1->categories()->attach(['1', '6']);

        Trip::create([
            "tour_id" => $tour1->id,
            "price" => "7200000",
            "discount_price" => "6990000",
            "capacity" => "48",
            "start_at" => "2024-08-17",
            "end_at" => "2024-08-20",
            "meal" => "FB"
        ]);

        $tour2 = Tour::create([
            "title" => "زیارتی مشهد",
            "description" => "تور 5 روزه مشهد مقدس اتوبوس vip",
            "transport" => "bus",
            "stay_class" => "hotel_apartment",
            "city_id" => "1",
            "details" => [
                "services" => "تمام وعده های غذایی شما حتی تا یک وعده اضافه با تور می‌باشد\nهمراهی بومیان آن منطقه جهت کشف مناطق بکر و دست نخورده\nهمراهی عکاس گروهی برای ثبت لحظات ناب شما\nتورلیدر با تجربه برای امنیت خاطر شما\nگشت و گذار آزادانه در مناطق مشخص شده طبق نظر تورلیدر شما",
                "stay_details" => "1 روز در مسیر و توقف در اماکن گردشگری در مسیر\n1 روز جنگل گردی\n2 روز کمپ و چادر",
                "documents" => "اسکن رنگی پاسپورت مسافر با حداقل 7 ماه اعتبار\nبیمه مسافرتی حداقل 30,000 دلار به تعداد روزهای سفر\nعکس 4*6 پشت سفید\nبلیط رفت و برگشت",
                "rules" => "حداقل بایستی 7 ماه تا تاریخ انقضای پاسپورت شما زمان باقی مانده باشد.\nپرداخت عوارض خروج از کشور به‌عهده مسافران گرامی است.\nتمامی هتل‌ها بصورت گارانتی می‌باشد و در صورت کنسلی هزینه‌ای عودت نخواهد شد.\nرخداد هرگونه حادثه‌ی طبیعی در سفر، احتمال تغییر در برنامه‌ی سفر را به‌دنبال خواهد داشت."
            ]
        ]);
        $tour2->categories()->attach(['1', '2', '5']);

        Trip::create([
            "tour_id" => $tour2->id,
            "price" => "8100000",
            "discount_price" => "7990000",
            "capacity" => "5",
            "start_at" => "2024-08-18",
            "end_at" => "2024-08-23",
            "meal" => "FB"
        ]);

        Trip::create([
            "tour_id" => $tour2->id,
            "price" => "8100000",
            "discount_price" => null,
            "capacity" => "72",
            "start_at" => "2024-08-21",
            "end_at" => "2024-08-26",
            "meal" => "HB"
        ]);

        $tour21 = Tour::create([
            "title" => "زیارتی مشهد",
            "description" => "تور 5 روزه مشهد مقدس قطار 4 ستاره",
            "transport" => "train",
            "stay_class" => "suite",
            "city_id" => "1",
            "details" => [
                "services" => "تمام وعده های غذایی شما حتی تا یک وعده اضافه با تور می‌باشد\nهمراهی بومیان آن منطقه جهت کشف مناطق بکر و دست نخورده\nهمراهی عکاس گروهی برای ثبت لحظات ناب شما\nتورلیدر با تجربه برای امنیت خاطر شما\nگشت و گذار آزادانه در مناطق مشخص شده طبق نظر تورلیدر شما",
                "stay_details" => "1 روز در مسیر و توقف در اماکن گردشگری در مسیر\n1 روز جنگل گردی\n2 روز کمپ و چادر",
                "documents" => "اسکن رنگی پاسپورت مسافر با حداقل 7 ماه اعتبار\nبیمه مسافرتی حداقل 30,000 دلار به تعداد روزهای سفر\nعکس 4*6 پشت سفید\nبلیط رفت و برگشت",
                "rules" => "حداقل بایستی 7 ماه تا تاریخ انقضای پاسپورت شما زمان باقی مانده باشد.\nپرداخت عوارض خروج از کشور به‌عهده مسافران گرامی است.\nتمامی هتل‌ها بصورت گارانتی می‌باشد و در صورت کنسلی هزینه‌ای عودت نخواهد شد.\nرخداد هرگونه حادثه‌ی طبیعی در سفر، احتمال تغییر در برنامه‌ی سفر را به‌دنبال خواهد داشت."
            ]
        ]);
        $tour21->categories()->attach(['1', '5']);

        $tour3 = Tour::create([
            "title" => "زیارتی مشهد",
            "description" => "تور 3 روزه مشهد مقدس هوایی",
            "transport" => "airplane",
            "stay_class" => "hotel",
            "city_id" => "1",
            "details" => [
                "services" => "تمام وعده های غذایی شما حتی تا یک وعده اضافه با تور می‌باشد\nهمراهی بومیان آن منطقه جهت کشف مناطق بکر و دست نخورده\nهمراهی عکاس گروهی برای ثبت لحظات ناب شما\nتورلیدر با تجربه برای امنیت خاطر شما\nگشت و گذار آزادانه در مناطق مشخص شده طبق نظر تورلیدر شما",
                "stay_details" => "1 روز در مسیر و توقف در اماکن گردشگری در مسیر\n1 روز جنگل گردی\n2 روز کمپ و چادر",
                "documents" => "اسکن رنگی پاسپورت مسافر با حداقل 7 ماه اعتبار\nبیمه مسافرتی حداقل 30,000 دلار به تعداد روزهای سفر\nعکس 4*6 پشت سفید\nبلیط رفت و برگشت",
                "rules" => "حداقل بایستی 7 ماه تا تاریخ انقضای پاسپورت شما زمان باقی مانده باشد.\nپرداخت عوارض خروج از کشور به‌عهده مسافران گرامی است.\nتمامی هتل‌ها بصورت گارانتی می‌باشد و در صورت کنسلی هزینه‌ای عودت نخواهد شد.\nرخداد هرگونه حادثه‌ی طبیعی در سفر، احتمال تغییر در برنامه‌ی سفر را به‌دنبال خواهد داشت."
            ]
        ]);
        $tour3->categories()->attach(['5']);

        Trip::create([
            "tour_id" => $tour3->id,
            "price" => "12600000",
            "discount_price" => "12150000",
            "capacity" => "43",
            "start_at" => "2024-08-29",
            "end_at" => "2024-08-01",
            "meal" => "AI"
        ]);

        Trip::create([
            "tour_id" => $tour3->id,
            "price" => "12600000",
            "discount_price" => null,
            "capacity" => "43",
            "start_at" => "2024-09-11",
            "end_at" => "2024-09-14",
            "meal" => "AI"
        ]);

        $tour4 = Tour::create([
            "title" => "آبگرم سرعین",
            "description" => "تور یک هفته‌ای آبگرم سرعین اتوبوس vip",
            "transport" => "bus",
            "stay_class" => "hotel",
            "city_id" => "5",
            "details" => [
                "services" => "تمام وعده های غذایی شما حتی تا یک وعده اضافه با تور می‌باشد\nهمراهی بومیان آن منطقه جهت کشف مناطق بکر و دست نخورده\nهمراهی عکاس گروهی برای ثبت لحظات ناب شما\nتورلیدر با تجربه برای امنیت خاطر شما\nگشت و گذار آزادانه در مناطق مشخص شده طبق نظر تورلیدر شما",
                "stay_details" => "1 روز در مسیر و توقف در اماکن گردشگری در مسیر\n1 روز جنگل گردی\n2 روز کمپ و چادر",
                "documents" => "اسکن رنگی پاسپورت مسافر با حداقل 7 ماه اعتبار\nبیمه مسافرتی حداقل 30,000 دلار به تعداد روزهای سفر\nعکس 4*6 پشت سفید\nبلیط رفت و برگشت",
                "rules" => "حداقل بایستی 7 ماه تا تاریخ انقضای پاسپورت شما زمان باقی مانده باشد.\nپرداخت عوارض خروج از کشور به‌عهده مسافران گرامی است.\nتمامی هتل‌ها بصورت گارانتی می‌باشد و در صورت کنسلی هزینه‌ای عودت نخواهد شد.\nرخداد هرگونه حادثه‌ی طبیعی در سفر، احتمال تغییر در برنامه‌ی سفر را به‌دنبال خواهد داشت."
            ]
        ]);
        $tour4->categories()->attach(['6']);

        Trip::create([
            "tour_id" => $tour4->id,
            "price" => "9500000",
            "discount_price" => null,
            "capacity" => "43",
            "start_at" => "2024-08-24",
            "end_at" => "2024-08-31",
            "meal" => "FB"
        ]);

        $tour5 = Tour::create([
            "title" => "کیش",
            "description" => "تور یک هفته‌ای کیش + تفریحات دریایی",
            "transport" => "airplane",
            "stay_class" => "hotel",
            "city_id" => "8",
            "details" => [
                "services" => "تمام وعده های غذایی شما حتی تا یک وعده اضافه با تور می‌باشد\nهمراهی بومیان آن منطقه جهت کشف مناطق بکر و دست نخورده\nهمراهی عکاس گروهی برای ثبت لحظات ناب شما\nتورلیدر با تجربه برای امنیت خاطر شما\nگشت و گذار آزادانه در مناطق مشخص شده طبق نظر تورلیدر شما",
                "stay_details" => "1 روز در مسیر و توقف در اماکن گردشگری در مسیر\n1 روز جنگل گردی\n2 روز کمپ و چادر",
                "documents" => "اسکن رنگی پاسپورت مسافر با حداقل 7 ماه اعتبار\nبیمه مسافرتی حداقل 30,000 دلار به تعداد روزهای سفر\nعکس 4*6 پشت سفید\nبلیط رفت و برگشت",
                "rules" => "حداقل بایستی 7 ماه تا تاریخ انقضای پاسپورت شما زمان باقی مانده باشد.\nپرداخت عوارض خروج از کشور به‌عهده مسافران گرامی است.\nتمامی هتل‌ها بصورت گارانتی می‌باشد و در صورت کنسلی هزینه‌ای عودت نخواهد شد.\nرخداد هرگونه حادثه‌ی طبیعی در سفر، احتمال تغییر در برنامه‌ی سفر را به‌دنبال خواهد داشت."
            ]
        ]);
        $tour5->categories()->attach(['1', '4', '12']);

        Trip::create([
            "tour_id" => $tour5->id,
            "price" => "14000000",
            "discount_price" => null,
            "capacity" => "83",
            "start_at" => "2024-09-03",
            "end_at" => "2024-09-10",
            "meal" => "AI"
        ]);

        $tour6 = Tour::create([
            "title" => "یزد",
            "description" => "تور یک هفته‌ای یزد + آفرود کویر",
            "transport" => "bus",
            "stay_class" => "cabin",
            "city_id" => "10",
            "details" => [
                "services" => "تمام وعده های غذایی شما حتی تا یک وعده اضافه با تور می‌باشد\nهمراهی بومیان آن منطقه جهت کشف مناطق بکر و دست نخورده\nهمراهی عکاس گروهی برای ثبت لحظات ناب شما\nتورلیدر با تجربه برای امنیت خاطر شما\nگشت و گذار آزادانه در مناطق مشخص شده طبق نظر تورلیدر شما",
                "stay_details" => "1 روز در مسیر و توقف در اماکن گردشگری در مسیر\n1 روز جنگل گردی\n2 روز کمپ و چادر",
                "documents" => "اسکن رنگی پاسپورت مسافر با حداقل 7 ماه اعتبار\nبیمه مسافرتی حداقل 30,000 دلار به تعداد روزهای سفر\nعکس 4*6 پشت سفید\nبلیط رفت و برگشت",
                "rules" => "حداقل بایستی 7 ماه تا تاریخ انقضای پاسپورت شما زمان باقی مانده باشد.\nپرداخت عوارض خروج از کشور به‌عهده مسافران گرامی است.\nتمامی هتل‌ها بصورت گارانتی می‌باشد و در صورت کنسلی هزینه‌ای عودت نخواهد شد.\nرخداد هرگونه حادثه‌ی طبیعی در سفر، احتمال تغییر در برنامه‌ی سفر را به‌دنبال خواهد داشت."
            ]
        ]);
        $tour6->categories()->attach(['1', '4', '12']);

        Trip::create([
            "tour_id" => $tour6->id,
            "price" => "8700000",
            "discount_price" => "8550000",
            "capacity" => "24",
            "start_at" => "2024-09-20",
            "end_at" => "2024-09-30",
            "meal" => "FB"
        ]);

        $tour7 = Tour::create([
            "title" => "بندرعباس",
            "description" => "تور یک هفته‌ای بندرعباس",
            "transport" => "bus",
            "stay_class" => "tent",
            "city_id" => "15",
            "details" => [
                "services" => "تمام وعده های غذایی شما حتی تا یک وعده اضافه با تور می‌باشد\nهمراهی بومیان آن منطقه جهت کشف مناطق بکر و دست نخورده\nهمراهی عکاس گروهی برای ثبت لحظات ناب شما\nتورلیدر با تجربه برای امنیت خاطر شما\nگشت و گذار آزادانه در مناطق مشخص شده طبق نظر تورلیدر شما",
                "stay_details" => "1 روز در مسیر و توقف در اماکن گردشگری در مسیر\n1 روز جنگل گردی\n2 روز کمپ و چادر",
                "documents" => "اسکن رنگی پاسپورت مسافر با حداقل 7 ماه اعتبار\nبیمه مسافرتی حداقل 30,000 دلار به تعداد روزهای سفر\nعکس 4*6 پشت سفید\nبلیط رفت و برگشت",
                "rules" => "حداقل بایستی 7 ماه تا تاریخ انقضای پاسپورت شما زمان باقی مانده باشد.\nپرداخت عوارض خروج از کشور به‌عهده مسافران گرامی است.\nتمامی هتل‌ها بصورت گارانتی می‌باشد و در صورت کنسلی هزینه‌ای عودت نخواهد شد.\nرخداد هرگونه حادثه‌ی طبیعی در سفر، احتمال تغییر در برنامه‌ی سفر را به‌دنبال خواهد داشت."
            ]
        ]);
        $tour7->categories()->attach(['2', '6', '7', '9']);

        Trip::create([
            "tour_id" => $tour7->id,
            "price" => "9700000",
            "discount_price" => null,
            "capacity" => "48",
            "start_at" => "2024-09-10",
            "end_at" => "2024-09-17",
            "meal" => "FB"
        ]);

        Trip::create([
            "tour_id" => $tour7->id,
            "price" => "9700000",
            "discount_price" => null,
            "capacity" => "48",
            "start_at" => "2024-10-08",
            "end_at" => "2024-10-15",
            "meal" => "FB"
        ]);
    }
}
